Some fixes + docs (#28)
* Adding tests to pretrain and fix bugs

Signed-off-by: Marc Romeyn <marcromeyn@gmail.com>

* Some fixes

Signed-off-by: Marc Romeyn <marcromeyn@gmail.com>

* Trying to get sft to work

Signed-off-by: Marc Romeyn <marcromeyn@gmail.com>

---------

Signed-off-by: Marc Romeyn <marcromeyn@gmail.com>
